ext.library.base.view.ResultEnum.SUCCESS.msg=Th\u00E0nh c\u00F4ng
ext.library.base.view.ResultEnum.LOGGED_IN.msg=Phi\u00EAn ch\u1EA1y kh\u00F4ng \u0111\u0103ng xu\u1EA5t, kh\u00F4ng \u0111\u0103ng nh\u1EADp
ext.library.base.view.ResultEnum.RESOURCE_ALREADY_INVALID.msg=T\u00E0i nguy\u00EAn \u0111\u00E3 th\u1EA5t b\u1EA1i
ext.library.base.view.ResultEnum.MOVED_PERMANENTLY.msg=\u0111\u01B0\u1EE3c di chuy\u1EC3n v\u0129nh vi\u1EC5n
ext.library.base.view.ResultEnum.FILE_EMPTY.msg=T\u1EA3i l\u00EAn t\u1EC7p l\u00E0 sai. B\u1EA1n \u0111\u00E3 g\u1EEDi m\u1ED9t y\u00EAu c\u1EA7u tr\u1ED1ng. N\u00EAn s\u1EED d\u1EE5ng c\u00F4ng c\u1EE5 ki\u1EC3m tra (ch\u1EB3ng h\u1EA1n nh\u01B0: Postman) \u0111\u1EC3 g\u1EE1 l\u1ED7i. C\u1EA7n l\u01B0u \u00FD r\u1EB1ng t\u1EC7p \u0111\u01B0\u1EE3c t\u1EA3i l\u00EAn ph\u1EA3i c\u00F3 lo\u1EA1i ph\u00F9 h\u1EE3p r\u00F5 r\u00E0ng (ch\u1EB3ng h\u1EA1n nh\u01B0 lo\u1EA1i v\u0103n b\u1EA3n:.txt)
ext.library.base.view.ResultEnum.BAD_REQUEST.msg=Y\u00EAu c\u1EA7u sai, x\u00E1c minh tham s\u1ED1 kh\u00F4ng \u0111\u01B0\u1EE3c ch\u1EA5p thu\u1EADn, vui l\u00F2ng tham kh\u1EA3o s\u00E9c API sau khi xem x\u00E9t
ext.library.base.view.ResultEnum.UNAUTHORIZED.msg=Kh\u00F4ng \u0111\u0103ng nh\u1EADp ho\u1EB7c kh\u00F4ng \u0111\u0103ng nh\u1EADp
ext.library.base.view.ResultEnum.ATTACK.msg=Truy c\u1EADp b\u1EA5t h\u1EE3p ph\u00E1p
ext.library.base.view.ResultEnum.FORBIDDEN.msg=Kh\u00F4ng c\u00F3 quy\u1EC1n
ext.library.base.view.ResultEnum.NOT_FOUND.msg=Kh\u00F4ng t\u00ECm th\u1EA5y
ext.library.base.view.ResultEnum.METHOD_NOT_ALLOWED.msg=C\u00E1c ph\u01B0\u01A1ng th\u1EE9c kh\u00F4ng cho ph\u00E9p ph\u01B0\u01A1ng th\u1EE9c y\u00EAu c\u1EA7u HTTP m\u00E0 m\u00E1y kh\u00E1ch kh\u00F4ng h\u1ED7 tr\u1EE3 cu\u1ED9c g\u1ECDi giao di\u1EC7n.
ext.library.base.view.ResultEnum.GONE.msg=Phi\u00EAn b\u1EA3n giao di\u1EC7n API hi\u1EC7n t\u1EA1i \u0111\u00E3 b\u1ECB b\u1ECF qua, vui l\u00F2ng c\u1EADp nh\u1EADt ph\u01B0\u01A1ng th\u1EE9c g\u1ECDi giao di\u1EC7n cho m\u00E1y kh\u00E1ch
ext.library.base.view.ResultEnum.UNSUPPORTED_MEDIA_TYPE.msg=Lo\u1EA1i ph\u01B0\u01A1ng ti\u1EC7n truy\u1EC1n th\u00F4ng kh\u00F4ng \u0111\u01B0\u1EE3c h\u1ED7 tr\u1EE3
ext.library.base.view.ResultEnum.TOO_MANY_REQUESTS.msg=Y\u00EAu c\u1EA7u th\u01B0\u1EDDng xuy\u00EAn cho hi\u1EC7n t\u1EA1i, vui l\u00F2ng th\u1EED l\u1EA1i sau
ext.library.base.view.ResultEnum.PARAM_VOID.msg=Tham s\u1ED1 tr\u1ED1ng
ext.library.base.view.ResultEnum.PARAM_CHECK_NOT_PASS.msg=N\u1EBFu x\u00E1c minh tham s\u1ED1 kh\u00F4ng \u0111\u01B0\u1EE3c ch\u1EA5p thu\u1EADn, vui l\u00F2ng tham kh\u1EA3o API sau khi ki\u1EC3m tra v\u00E0 l\u1EA1i
ext.library.base.view.ResultEnum.PARAM_VALUE_INVALID.msg=Vi\u1EC7c x\u00E1c minh tham s\u1ED1 kh\u00F4ng \u0111\u01B0\u1EE3c th\u00F4ng qua, gi\u00E1 tr\u1ECB kh\u00F4ng h\u1EE3p l\u1EC7
ext.library.base.view.ResultEnum.PARAM_DECRYPT_ERROR.msg=L\u1ED7i gi\u1EA3i m\u00E3 tham s\u1ED1
ext.library.base.view.ResultEnum.INTERNAL_SERVER_ERROR.msg=L\u1ED7i m\u00E1y ch\u1EE7 n\u1ED9i b\u1ED9
ext.library.base.view.ResultEnum.REQUEST_ERROR.msg=Y\u00EAu c\u1EA7u l\u1ED7i
ext.library.base.view.ResultEnum.BAD_GATEWAY.msg=C\u1ED5ng x\u1EA5u
ext.library.base.view.ResultEnum.SERVICE_UNAVAILABLE.msg=d\u1ECBch v\u1EE5 kh\u00F4ng kh\u1EA3 d\u1EE5ng
ext.library.base.view.ResultEnum.GATEWAY_TIMEOUT.msg=C\u1ED5ng Time-out
ext.library.base.view.ResultEnum.DATA_STRUCTURE.msg=C\u1EA5u tr\u00FAc d\u1EEF li\u1EC7u b\u1EA5t th\u01B0\u1EDDng
ext.library.base.view.ResultEnum.DB_ERROR.msg=C\u1EA5u tr\u00FAc d\u1EEF li\u1EC7u l\u00E0 b\u1EA5t th\u01B0\u1EDDng, vui l\u00F2ng ki\u1EC3m tra t\u00EDnh nh\u1EA5t qu\u00E1n c\u1EA5u tr\u00FAc d\u1EEF li\u1EC7u t\u01B0\u01A1ng \u1EE9ng
ext.library.base.view.ResultEnum.CLIENT_FALLBACK.msg=M\u1EA1ng nh\u1ECF, vui l\u00F2ng th\u1EED l\u1EA1i sau ...
ext.library.base.view.ResultEnum.CLIENT_FALLBACK_ERROR.msg=\u1EDE giai \u0111o\u1EA1n hi\u1EC7n t\u1EA1i, \u00E1p l\u1EF1c d\u1ECBch v\u1EE5 qu\u00E1 cao, vui l\u00F2ng th\u1EED l\u1EA1i sau ...
ext.library.base.view.ResultEnum.TYPE_CONVERT_ERROR.msg=Lo\u1EA1i l\u1ED7i chuy\u1EC3n \u0111\u1ED5i